
/*
Цього разу я також не дивився документації чи відео,
не підглядав в будь-які джерела, а просто вирішив ще раз написати програму.
Все таки в мене вийшло - без костилів, довго, нудно, але вийшло.
Секрет полягав в тому, що я був напористим, мені подобалось те,
що я роблю, подобалось навіть те, що в мене це не виходить,
я одразу думав, що це те, що мені потрібно - я сам створив цю програму,
сам вирішив її "оптимізувати", розбити на класи.
Та в кінці кінців дійшов до висновку: все потрібно робити по черзі.
Я проаналізував свій минулий код, розібрався, чому він не працював.
Все виявилось дуже просто: я працював як програма, писав код по черзі,
уникаючи основ ООП.
В цьому і була вся проблема, варто було мені віднести всі числа - до чисел,
всі слова - до слів, відсортувати все по черзі -
і о чудо, все запрацювало так, як і працювало до цього.
Лише тепер, я розбив все на класи, поля та об'єкти.
Я неймовірно радий, що в мене вийшло.
Я потратив всього лише кілька годин на вирішення цієї,
досить таки об'ємної теми, в моїй улюбленій мові програмування.
Проте, мені ще є до чого йти. Буду чесним - я здавався двічі,
просто не виходило і я казав що "та ну в баню це всьо".
І лише сьогодні, згадуючи, як працює наш мозок,
який на нову інформацію постійно каже "ні, воно тобі не потрібно" - я пересилив себе,
просто залишився на місці, нікуди не пішов.
Навіть без уявлення, як це зробити - я просто писав код, автоматично.
Мої руки самі натискали на клавіші, мій мозок не думав,
я сам ніби просто спостерігав за собою зі сторони.
Склалось враження, ніби в мені живе ще щось, або хтось,
який вирішив не бути мною більше. І я неймовірно вдячний другому собі.
Ще ніколи я так не радів тому, що вирішив таку банальну річ.
Мені здається, в цьому і є сенс програмування - думати, та бути вдячним, що ти можеш це робити.
*/


import java.util.Scanner;
public class lern {
    public static void main(String [] args) {
        Calc calc = new Calc();
        calc.all_lessons();;
        calc.your_lvl_now();
        calc.you_done_lvls();
        calc.you_done();
        calc.how_much_days_you_spend();
        calc.you_spend();
    }
}

class Calc {
    Scanner scanner = new Scanner(System.in);
    int my_lvl;
    int days;
    int lessons = 9;
    int levels = 20;
    int library = 5;

    int all() {
        int all = (library * levels) * lessons;
        return all;
    }
    void all_lessons() {
        System.out.println("Уроків загалом: " + all());
    }
    void your_lvl_now() {
        System.out.print("Ваш рівень зараз: ");
    }
    void you_done_lvls(){
        my_lvl = scanner.nextInt();
        System.out.println("Ви виконали: " + my_lvl);
    }
    void you_done() {
        System.out.println("Все, що ви повинні зробити (в кількостях уроків): " + all());
        System.out.println("Ви виконали зараз (в кількостях уроків): " + (my_lvl * lessons));
        System.out.println("Залишилось зробити (в кількостях уроків): " + (all() - (my_lvl * lessons)));
    }

    void how_much_days_you_spend(){
        System.out.print("Скільки днів ви витратили? : ");
        days = scanner.nextInt();
    }
    void you_spend() {
        System.out.println("Ви витратили: " + days + " днів");
        System.out.println("Це приблизно: " + (all() / ((my_lvl * lessons) / days)) + " днів, щоб завершити JavaRush");
        System.out.println("Або " + ((all() / ((my_lvl * lessons) / days)) / 30) + " місяців");
    }
}